#За день машина проезжает n километров. Сколько дней нужно,
#чтобы проехать маршрут длиной m километров? 
#При решении этой задачи нельзя пользоваться условной 
#инструкцией if и циклами.

#Input:
#n = 700
#m = 750
#Output:
#2
#n = int(input("Расстояние в день: "))
#m = int(input("Общее расстояние: "))
#print(f"Для преодоления нужно: {math.ceil(m/n)} дней")
#print("Для преодоления нужно:",(m // n) +1,"дней")

'''
n = int(input("Расстояние в день: "))
m = int(input("Общее расстояние: "))
res = -(-m // n)
print(res)
'''
